{
  "education": [
    {
      "awards_achievements": [
        "2000$ recruitment scolarship",
        "2000$ scolarship of excellence during 2020 academic year",
        "1000$ scolarship of excellence during 2021 academic year",
        "President of the Computer Sciences department Student council",
        "Technical assistant for New Brunswick high schools programming contest in 2022",
        "GPA: 3.5/4.3"
      ],
      "degree": "Bachelor of Applied Sciences",
      "department": "Computer Sciences",
      "duration": "2018-2023",
      "school_name": "Universite de Moncton"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AhmadouGaye",
  "highlighted_projects": [
    {
      "description": "Implemented using a Bash script, the Raspberry Pi connectivity monitor was developed to detect Internet connection issues in real time, ensuring the functionality of the company's client devices at all times. The app periodically checks the device's Internet connection, sends signals when the connection is no longer working, and attempts to troubleshoot it using methods such as deactivating and then reactivating Wi-Fi, switching from Wi-Fi to wired or Bluetooth connections.",
      "git_url": null,
      "name": "Raspberry pi Connectivity monitor"
    },
    {
      "description": "Developed using Python, OpenCV, and deep learning, it was an academic project at university that involved detecting the presence of a hand through a camera and displaying the number of fingers shown in real time.",
      "git_url": null,
      "name": "Computer Vision project"
    },
    {
      "description": "Designed using SQL, with the mySQL RDBMS and Python, this project consisted in creating, normalizing, inserting datas and managing the database. The datas are inserted with a Python scripts which collects datas from a Excel file and inserts them in the appropriate tables automatically.",
      "git_url": null,
      "name": "Database conception for a university restaurant Web/Mobile app "
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed using Bash and PSQL languages, encapsulated in Docker containers for shipping and deployment, and all of that in a Unix environment, the Linux cluster monitor collects data about hardware specifications and places it in a database table. It also collects host usage information every minute and puts it in another table in the same database.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_AhmadouGaye",
      "name": "Linux Cluster Monitor"
    },
    {
      "description": "This project serves both as a learning experience and a practical application. Through its execution, I have gained significant insights into data modeling, data definition, logical structuring for SQL queries, and data optimization techniques. In the forthcoming sections, I will delve into our database schema configuration, the SQL queries I formulated, and their respective applications.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_AhmadouGaye",
      "name": "RDBMS and SQL project"
    },
    {
      "description": "Designed and developed in a mainframe environment using Cobol, DB2, JCL and CICS, this project allows to perform some operation on a student personnal informations database as inserting, deleting, updating, filtering and making reports.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_AhmadouGaye",
      "name": "Mainframe development - Student registration system"
    }
  ],
  "name": "Ahmadou Gaye",
  "others": [
    {
      "bullets": [
        "SQL cerificate from Test dome",
        "Cobol essential learning certificate from LinkedIn learning",
        "IBM practitionner badge"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Soccer player",
        "Competitive gaming",
        "Going to gym 4 times a week"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Working in Software Engineering field using the most recents technologies and methodologies in the field",
      "duration": "2024-present",
      "title": "Data engineer"
    },
    {
      "company": "TD Canada",
      "description": "Worked as a front line agent for fraud victims. My mission was to mitigate risk for the bank and the clients following a process.",
      "duration": "2023-2024",
      "title": "Loss prevention advisor"
    },
    {
      "company": "Universite de Moncton",
      "description": "Worked in a four months internship on web site back-end project.",
      "duration": "2023",
      "title": "Intern back-end developer"
    },
    {
      "company": "Elumicate Inc.",
      "description": "Worked in a four months internship on Linux and Artificial intelligence projects.",
      "duration": "2022",
      "title": "Intern Software developer"
    }
  ],
  "skills": {
    "competent": [
      "IMS",
      "CICS",
      "Excel",
      "Math",
      "Web development"
    ],
    "familiar": [
      "Artificial intelligence tools",
      "ML / DL / Computer vision",
      "Visual Basic",
      "Parallel programming",
      "Logic programming",
      "Functional programming"
    ],
    "proficient": [
      "Cobol",
      "DB2",
      "ISPF and TSO",
      "JCL",
      "Java",
      "Maven",
      "Docker",
      "C++",
      "Python",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "As bilingual junior mainframe developer at Jarvis, I have a good background in COBOL, DB2, ISPF, JCL, CICS and IMS. After five years of studies and eight months of internship, I obtained a B. Sc. in Applied Computer Sciences with some strong coding skills and computers organization understanding. Witnessing the fast evolution of computers and softwares is the reason why I got interested in the world of data and has guided me through Jarvis where I got specialized through many IBM certified learnings and real-world project related to Mainframe engineering and many other fields."
}
